{"id":4200,"date":"2017-10-24T08:37:09","date_gmt":"2017-10-24T08:37:09","guid":{"rendered":"https:\/\/www.mountainbikeworldwide.com\/guide-stories\/switzerland-mountain-bike-tour-photos"},"modified":"2023-11-22T09:37:15","modified_gmt":"2023-11-22T09:37:15","slug":"switzerland-mountain-bike-tour-photos","status":"publish","type":"post","link":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos","title":{"rendered":"Switzerland Mountain Bike Tour in Photos"},"content":{"rendered":"<div class=\"wpb-content-wrapper\"><p>[vc_row][vc_column][vc_empty_space height=&#8221;32&#8243;][vc_column_text css=&#8221;.vc_custom_1508772143051{margin-top: 20px !important;}&#8221;]<\/p>\n<h1>Switzerland Mountain Bike Tour in Photos<\/h1>\n<p>[\/vc_column_text][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][vc_column_text]<\/p>\n<p class=\"margin\">Delve head first into our new <a href=\"https:\/\/www.mountainbikeworldwide.com\/mtb-tours\/switzerland\">mountain bike tour Switzerland<\/a> as we traverse the magical Graubünden region with the help of Thomas Vanderham.<\/p>\n<p>[\/vc_column_text][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h2>Seeking Swiss Singletrack<\/h2>\n<p class=\"p1\"><span class=\"s1\">Yet another day spent adrift in the vast sea of Eurobike, following the crowd as we drain from one hall to another. The only thing keeping me going is the thought of diving over the border into Switzerland later that evening with the promise of uncovering meandering Alpine singletrack. We were undertaking a long planned assault on Switzerland that was assembled back in May last year when Thomas Vanderham had come over to Scotland to ride for a Shimano video… Maybe one too many bottles of Lagavulin 16 Year Old had been consumed that week, but somehow later down the line the boys found themselves steaming into Switzerland. (With another 2 bottles of Lagavulin for old times’ sake!)<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">Our plan, aided by friend and local H+I guide, Dave Spielmann was to link up a Trans-Graubünden Switzerland mountain biking tour via pedal power and use of the extensive, punctual, and rather bike friendly Swiss public transport system. We reached our starting point of Lenzerheide close to midnight after a couple of train swaps and dash for the PostBus which, thankfully, didn’t result in a hefty Swiss speeding fine like my previous venture to Lenzerheide for the World Cup…<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">The danger with being in the Alps late season is, well, it’s the Alps and as popular as it has become for mountain biking, skiing is still very much the staple sport here and for skiing you need snow. Something that doesn’t go hand-in-hand with cycling too well. Fortunately a tentative snoop out the window of our Lenzerheide hotel confirmed that Rothorn stretching above us was, for the large part, still red, albeit with the odd lingering patch of white. After fumbling our bikes out of their travel bag jigsaws we soon find ourselves with a bird’s-eye view over the World Cup track as the gondola hums its way towards the craggy peak on the skyline. Leaving the safety of the top station we were soon victim to the icy wind which greeted us like a slap in the face, thankfully abating as we hooked round the next rocky outcrop; our trail now flirting with us as it stretched into the Mordor-esque mountains on the horizon. Any lingering Eurobike hangover seems a lifetime ago. It doesn&#8217;t take long for us to begin surfing the strand of path clinging onto the hillside, reminding myself all the while ‘fall left fall left’ &#8211; which is hard when there is a turquoise snow-melt lake below you! As the altitude falls away we soon find ourselves riding in the clouds as we hit some classic Alpine switchbacks giving the group an accordion effect as we yo-yo, back and forth, out of each turn. Eventually springing out between wooden chalets as we hunt for the next gondola which promises rösti atop the neighbouring mountain.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">From the warmth of our rösti refuge we can once again look down on the cloud base with the mountain ranges thrusting their way skywards with a mix of cheese, potatoes, and coffee sitting heavy in our stomachs &#8211; making it extra difficult to restart the legs! Dodging marmots we weave our way through a flowing gulley and into the edge of the bike park where a sudden deluge sparks the end of our day as we take a muddy bobsleigh ride back to the valley floor, the safety of the hotel, and a ‘deserved’ weiss beer.<\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">The evening was spent looking through a mirage of various weather sites and apps with conflicting reports, rain or snow? We’d have to wait and see, but for the moment it was only rain drumming off the ground outside as we went to bed resigned to our fate.<\/span><\/p>\n<p class=\"bigquote\">&#8220;our trail now flirting with us as it stretched into the Mordor-esque mountains on the horizon. Any lingering Eurobike hangover seems a lifetime ago.&#8221;<\/p>\n<p>[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_media_grid element_width=&#8221;3&#8243; initial_loading_animation=&#8221;none&#8221; grid_id=&#8221;vc_gid:1700645734270-a1451344-9cc8-5&#8243; include=&#8221;28606,28609,28608,28611&#8243;][vc_single_image image=&#8221;4202&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_single_image image=&#8221;4203&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4204&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4205&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][vc_column_text css=&#8221;.vc_custom_1508831010155{margin-top: 15px !important;}&#8221;][\/vc_column_text][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<span class=\"s1\">Peeling back the curtains revealed a landscape more akin to a Christmas card than the Alps in September. Our breakfast was rather leisurely as we figured out our game plan and watched out the window as a solo fat biker smuggly left from the garage to continue on with his business and disappeared into the white. We decided to cut our losses and head to our next target of Davos with the day better spent sitting in coffee shops whilst the snow-line retreated. <\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">Thankfully by the following morning the snow was confined to the mountain tops, we’d be sure to find some throughout the day but by-and-large the trails should be rideable! The Swiss are well known for their efficiency and their impressive lattice of lifts are testament to that, they certainly helped us get bang for our buck as we swiftly found ourselves looking back down upon Davos clustered on the valley floor below. Pushing on through the slush it doesn’t take long for our feet to resemble ice cubes, and soon after I’m the first to taste the Swiss dirt. Obviously blaming it on the monstrous boulder kicked up by someone in front. Through the clang of a herd of cows, doing our best to dodge their expertly placed ‘parcels’, the trail becomes faster and more flowing before, apparently, we are funnelled into the woods of British Columbia. It’s a brief but lively affair as we are spat into the outskirts of Davos with our next destination already locked in our sights. This trail had been hyped up by Dave and Euan in the days prior, and with the gondola empty apart from a young couple complete with pram, it looked like we’d have the place to ourselves. The technical traverse passes quickly with everyone enjoying the challenge of its various rock steps. It’s hard not to feel insignificant in a landscape like this with the vertical mountainsides reaching deep into the valley, we are a mere speck on a string in the vista. <\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">Over time our wheels begin to point downhill more and more and soon we are thrust into a rollercoaster of turns, the air becoming filled with rapturous noise of appreciation &#8211; the kind of trail that makes you feel like a hero even if your skill level says otherwise. With arms screaming I drop the anchors, almost cause a pileup in doing so but when a turn feels that outrageously good you’ve just got to go back and session it! Mark and the rest of the boys needed no convincing either. Following Thomas, or rather attempting to, was an eyeopener. Riders of that calibre read the terrain completely differently to a mere mortal like myself, playing and popping off seemingly nothing, and doing it with such a casual swagger as I’m pouring all my focus into merely keeping him in sight. The trail eventually fizzles out and pops us onto a road in the Sertig valley which induced a speed tuck content as we roll <\/span><span class=\"s1\">into the accommodation &#8211; our bags waiting for us thanks to more Swiss efficiency in luggage transfers. After a lengthy shower to bring the body back up to temperature we are soon sitting round a molten pot of fondue reflecting on what was, not only the best trail of the trip so far, but also perhaps up there with one of the best we’d ever ridden. <\/span><\/p>\n<p class=\"bigquote\">&#8220;It’s hard not to feel insignificant in a landscape like this with the vertical mountainsides reaching deep into the valley, we are a mere speck on a string in the vista.&#8221;<\/p>\n<p class=\"p1\"><span class=\"s1\">With a shot of espresso to burn through the remainder of last night’s wine we find ourselves once again staring out the window over breakfast wondering where summer has vanished to. The snow had returned and the cloud blanketed the hills. There was no patience for the weather this morning so the thermals and waterproofs were dug out and a b-line made for the valley side to begin hammering pedals up the climb of the path awarded an ‘IMBA Epic Trail’. It’s not hard to see why. The moody weather only adds a magical and eerie feel as the mist clings to the pine trees as we plod forward. We briefly take shelter in a mountain hut and use the opportunity to fill our water from a nearby spring, all the while the cloud lifting and skies becoming brighter. The trail skirts round a pocket of rustic wooden cabins before plunging through a melt water stream and back into the woods, our tyres struggling for purchase on the contours of rocks and roots. We approach our rendezvous point after a short cruise on a farm track where we draw some questionable looks from the local cows. Bikes loaded, we are heading for the Albula Pass whilst the shuttle driver proudly tells us of his time ferrying Danny MacAskill around the region for a new video. With a fast spike of altitude we are soon scrambling for down jackets as the doors are flung open. There’s no easing into it as we viciously try to jumpstart our legs and lungs as they burn in complaint, meanwhile the sun pierces through a wedge in the heavy black clouds, giving us a rather spectacular light show as we press on through a flurry of snow. A thundering river is our indicator of direction as we carefully pick our way through the rock-littered trail with the surface water licking at our legs. By now our bodies are feeling the effect of the cold which made reaching the hotel, washing the bikes, and hitting the sauna all the more sweet.<\/span><\/p>\n<p>[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4206&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4207&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_single_image image=&#8221;4208&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_single_image image=&#8221;4209&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_media_grid element_width=&#8221;3&#8243; initial_loading_animation=&#8221;none&#8221; grid_id=&#8221;vc_gid:1700645734280-01fdb9cd-d20b-8&#8243; include=&#8221;28617,28618,28620,28622&#8243;][vc_empty_space][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][vc_column_text css=&#8221;.vc_custom_1508830999287{margin-top: 15px !important;}&#8221;][\/vc_column_text][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<p class=\"p1\"><span class=\"s1\">Dawn broke to reveal a surreal stillness, the air seemed almost viscous with the lingering mist the clear night had left behind. It was going to be a perfect bluebird day. Breakfast was rushed or efficient depending on your nationality… The Swiss keeping the Scots and Canadian in check, there was a train to catch after all. We needn’t have worried, not even Swiss efficiency can overcome icy rails. Thirty minutes of shivering later the bikes were carted onto the train and we were glued to the windows as the train made its way up the scandalously stunning Bernina Pass. A glacial green lake signals our time to disembark, the train pulls away to re-reveal the impactful mountains as we stand on the platform in awe. The crunch of ice shattering under wheel is a strangely satisfying feeling as we crest the short but punchy climb revealing a vast headwall with a glacier hanging from its figure. Edging round switchback after switchback with a burst of speed and heavy braking in-between, we rattle over the railway line and exit onto a plateau surrounded by jagged ridge lines &#8211; the feeling of insignificance returns. We bolt back into the tree-line on a crazily diverse trail which starts fast and flowing before changing to steep, technical slabs of rock, and ultimately finishing with a teeth-rattling death grip through some long rock gardens. Edging closer to the border we saunter into Poschiavo which feels like the lovechild of Swiss and Italian cultures &#8211; the perfect combination for four hungry mountain bikers. Gorging on meat and cheese platters, three rounds of pasta, gelato, and espresso… It was fair to say we were stocked up for the long burn to the overnight in the mountain hut of San Romero. <\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">It doesn’t take long for the others to stretch their legs and create a gap in front; I was paying the price for a lazy summer behind the camera instead of behind the bars. Not even two shouty sheepdogs pacing their fence line can do much to spur me on as I mash the cranks back and forth. Eventually I round another switchback to find the trio sprawled on the grass soaking up the sun. “Wasn’t so bad was it?” Euan blurts out. I needn’t reply as the sweat rolls off my face. Dave assures me it traverses from here on, the kind of traverse that apparently repeatedly stings you with viscous ramps… although I get redemption for my moaning \/ suffering when we leave the woods into the rich evening light, in sight of the mountain-hut. With photographer mode engaged I begin running around the hillside barking orders as I make the boys work for their beer. With one last run and burst of red rays, the sun plummets behind the ridge. They can tell from my face I’m stoked with the result. Gino greets us with a round of local brew as the night slowly takes hold. The stars make a brief appearance as we watch the cloud shroud the glowing lights of Italy a few kilometres down the valley. <\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">With most of the hard work done last night we were excited to cruise into Tirano, Italy for the lure of pizza. There had been a subtle but gradual change in the terrain since we’d left Lenzerheide, the surroundings green and lush compared to the rocky and barren mountainsides at the start of the week. Skimming past farm buildings at mach ten the grass soon changes for rocks and cobbles as we funnel through the tight alleyways and into the vineyards of Italy. A glance backwards reveals the vert we’ve dropped with the mountain refuge a white spot above us. Rolling through the bustling streets of Tirano on this, the last day of our Switzerland mountain biking tour, we begin sniffing out a pizzeria, conveniently finding one a stone’s-throw from the train station. It might not even be midday but you can’t pass up pizza in Italy. As they say, when in Rome… Inhaling would be a more appropriate term for how quickly they were consumed. <\/span><\/p>\n<p class=\"bigquote\">&#8220;There had been a subtle but gradual change in the terrain since we’d left Lenzerheide, the surroundings green and lush compared to the rocky and barren mountainsides at the start of the week.&#8221;<\/p>\n<p>[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_media_grid element_width=&#8221;3&#8243; initial_loading_animation=&#8221;none&#8221; grid_id=&#8221;vc_gid:1700645734284-ac844cf8-8ded-10&#8243; include=&#8221;28634,28621,28623,28625&#8243;][vc_single_image image=&#8221;4210&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4211&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4212&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][vc_column_text css=&#8221;.vc_custom_1508830999287{margin-top: 15px !important;}&#8221;][\/vc_column_text][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<p class=\"p1\"><span class=\"s1\">We’d reached our furthest point south on our Switzerland mountain biking tour and for one final fling we were back aboard the Bernina Express headed to the top of the pass. Retracing our steps we can view a lot of our riding landmarks as they pass by during the train’s corkscrew route up to Ospizio Bernina. As the train summits next to the lake once again, we prepare for our Graubünden grand finale into Pontresina with reality beckoning in the form of a morning airport transfer. We skim the edge of the lake whilst being buffeted by the wind which seemed to be doing its best to force us back into Italy. Thankfully it eases over the next crest where we savour a small sample of one of the many popular flow trails in the region. It’s short and sweet before we swoop into the woods for a last dose of Swiss tech; autumn beginning to flirt with the forest. Everyone’s riding reflects the fact this is our final day. Dave is trying to rip our legs off up each climb whilst Thomas has turned up the descending a notch. Soon we are rolling through the streets of Pontresina with glamorous looking hotels on either flank, a slight juxtaposition to the four of us caked in mud. <\/span><\/p>\n<p class=\"p1\"><span class=\"s1\">Once the dirty bikes and kit had been ditched and a bottle of Lagavulin uncovered from a bike bag we were set for the night. Now this is the part of the story where I’m supposed to talk about how we spent the evening mulling over the ‘emotional’ journey we undertook during this Switzerland mountain biking tour … In reality we drank a little too much, didn’t talk a whole lot about bikes, and laughed mostly at (and with) each other, because that’s what mates are for! But on a serious note Switzerland had treated us to some of the finest riding we’ve experienced, and better still it was rather effortless to access thanks to the Swiss grid of transport links and mountain lifts enabling us to connect the dots on so many Alpine gems.<\/span><\/p>\n<p>[\/vc_column_text][vc_empty_space][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4213&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column][vc_column width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4214&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_media_grid initial_loading_animation=&#8221;none&#8221; grid_id=&#8221;vc_gid:1700645734287-7f8e9f59-35eb-5&#8243; include=&#8221;28631,28632,28633&#8243;][vc_single_image image=&#8221;4215&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_single_image image=&#8221;4216&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_empty_space][\/vc_column][vc_column][\/vc_column][\/vc_row][vc_row][vc_column][\/vc_column][\/vc_row][vc_row][vc_column][\/vc_column][\/vc_row]<\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Read all about our new Switzerland mountain bike tour &#8211; in words and photos<\/p>\n","protected":false},"author":1,"featured_media":2533,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[41,47],"tags":[],"class_list":["post-4200","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-destinations","category-travel-inspiration"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v23.4 (Yoast SEO v24.2) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Switzerland mountain biking tour in photos | H+I Adventures<\/title>\n<meta name=\"description\" content=\"Our photographer Ross Bell takes you through our new Switzerland mountain biking tour in photos and words, from Lenzerheide to Pontresina\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Switzerland Mountain Bike Tour in Photos\" \/>\n<meta property=\"og:description\" content=\"Our photographer Ross Bell takes you through our new Switzerland mountain biking tour in photos and words, from Lenzerheide to Pontresina\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos\" \/>\n<meta property=\"og:site_name\" content=\"H+I Adventures\" \/>\n<meta property=\"article:published_time\" content=\"2017-10-24T08:37:09+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-11-22T09:37:15+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"form_admin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"form_admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos\"},\"author\":{\"name\":\"form_admin\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/5dc539fefacbad4fbd5ad01fc49c0b97\"},\"headline\":\"Switzerland Mountain Bike Tour in Photos\",\"datePublished\":\"2017-10-24T08:37:09+00:00\",\"dateModified\":\"2023-11-22T09:37:15+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos\"},\"wordCount\":3302,\"publisher\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/10\/Switzerland-Blog-Header-1.jpg\",\"articleSection\":[\"Destinations\",\"Travel Inspiration\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos\",\"url\":\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos\",\"name\":\"Switzerland mountain biking tour in photos | H+I Adventures\",\"isPartOf\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/10\/Switzerland-Blog-Header-1.jpg\",\"datePublished\":\"2017-10-24T08:37:09+00:00\",\"dateModified\":\"2023-11-22T09:37:15+00:00\",\"description\":\"Our photographer Ross Bell takes you through our new Switzerland mountain biking tour in photos and words, from Lenzerheide to Pontresina\",\"breadcrumb\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#primaryimage\",\"url\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/10\/Switzerland-Blog-Header-1.jpg\",\"contentUrl\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/10\/Switzerland-Blog-Header-1.jpg\",\"width\":1170,\"height\":460,\"caption\":\"Mountain bikers stopping to catch their breath in the mountains above Poschiavo during our mountain bike tour Switzerland.\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.mountainbikeworldwide.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Switzerland Mountain Bike Tour in Photos\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#website\",\"url\":\"https:\/\/www.mountainbikeworldwide.com\/\",\"name\":\"H+I Adventures\",\"description\":\"At H+I Adventures we specialise in crafting life-affirming MTB tours and e-mountain bike holidays in exotic locations around the world. That’s all we do.\",\"publisher\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.mountainbikeworldwide.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#organization\",\"name\":\"H+I Adventures\",\"url\":\"https:\/\/www.mountainbikeworldwide.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png\",\"contentUrl\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png\",\"width\":1200,\"height\":630,\"caption\":\"H+I Adventures\"},\"image\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/5dc539fefacbad4fbd5ad01fc49c0b97\",\"name\":\"form_admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/38964b5c442fcfa6225311b084d13024?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/38964b5c442fcfa6225311b084d13024?s=96&d=mm&r=g\",\"caption\":\"form_admin\"},\"sameAs\":[\"https:\/\/h-i.form-digital-staging.com\"],\"url\":\"https:\/\/www.mountainbikeworldwide.com\/author\/form_admin\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Switzerland mountain biking tour in photos | H+I Adventures","description":"Our photographer Ross Bell takes you through our new Switzerland mountain biking tour in photos and words, from Lenzerheide to Pontresina","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos","og_locale":"en_US","og_type":"article","og_title":"Switzerland Mountain Bike Tour in Photos","og_description":"Our photographer Ross Bell takes you through our new Switzerland mountain biking tour in photos and words, from Lenzerheide to Pontresina","og_url":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos","og_site_name":"H+I Adventures","article_published_time":"2017-10-24T08:37:09+00:00","article_modified_time":"2023-11-22T09:37:15+00:00","og_image":[{"width":1200,"height":630,"url":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png","type":"image\/png"}],"author":"form_admin","twitter_card":"summary_large_image","twitter_misc":{"Written by":"form_admin","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#article","isPartOf":{"@id":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos"},"author":{"name":"form_admin","@id":"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/5dc539fefacbad4fbd5ad01fc49c0b97"},"headline":"Switzerland Mountain Bike Tour in Photos","datePublished":"2017-10-24T08:37:09+00:00","dateModified":"2023-11-22T09:37:15+00:00","mainEntityOfPage":{"@id":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos"},"wordCount":3302,"publisher":{"@id":"https:\/\/www.mountainbikeworldwide.com\/#organization"},"image":{"@id":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#primaryimage"},"thumbnailUrl":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/10\/Switzerland-Blog-Header-1.jpg","articleSection":["Destinations","Travel Inspiration"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos","url":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos","name":"Switzerland mountain biking tour in photos | H+I Adventures","isPartOf":{"@id":"https:\/\/www.mountainbikeworldwide.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#primaryimage"},"image":{"@id":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#primaryimage"},"thumbnailUrl":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/10\/Switzerland-Blog-Header-1.jpg","datePublished":"2017-10-24T08:37:09+00:00","dateModified":"2023-11-22T09:37:15+00:00","description":"Our photographer Ross Bell takes you through our new Switzerland mountain biking tour in photos and words, from Lenzerheide to Pontresina","breadcrumb":{"@id":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#primaryimage","url":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/10\/Switzerland-Blog-Header-1.jpg","contentUrl":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/10\/Switzerland-Blog-Header-1.jpg","width":1170,"height":460,"caption":"Mountain bikers stopping to catch their breath in the mountains above Poschiavo during our mountain bike tour Switzerland."},{"@type":"BreadcrumbList","@id":"https:\/\/www.mountainbikeworldwide.com\/destinations\/switzerland-mountain-bike-tour-photos#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.mountainbikeworldwide.com\/"},{"@type":"ListItem","position":2,"name":"Switzerland Mountain Bike Tour in Photos"}]},{"@type":"WebSite","@id":"https:\/\/www.mountainbikeworldwide.com\/#website","url":"https:\/\/www.mountainbikeworldwide.com\/","name":"H+I Adventures","description":"At H+I Adventures we specialise in crafting life-affirming MTB tours and e-mountain bike holidays in exotic locations around the world. That’s all we do.","publisher":{"@id":"https:\/\/www.mountainbikeworldwide.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.mountainbikeworldwide.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.mountainbikeworldwide.com\/#organization","name":"H+I Adventures","url":"https:\/\/www.mountainbikeworldwide.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png","contentUrl":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png","width":1200,"height":630,"caption":"H+I Adventures"},"image":{"@id":"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/5dc539fefacbad4fbd5ad01fc49c0b97","name":"form_admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/38964b5c442fcfa6225311b084d13024?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/38964b5c442fcfa6225311b084d13024?s=96&d=mm&r=g","caption":"form_admin"},"sameAs":["https:\/\/h-i.form-digital-staging.com"],"url":"https:\/\/www.mountainbikeworldwide.com\/author\/form_admin"}]}},"_links":{"self":[{"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/posts\/4200","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/comments?post=4200"}],"version-history":[{"count":5,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/posts\/4200\/revisions"}],"predecessor-version":[{"id":5941,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/posts\/4200\/revisions\/5941"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/media\/2533"}],"wp:attachment":[{"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/media?parent=4200"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/categories?post=4200"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/tags?post=4200"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}