{"id":4386,"date":"2018-02-01T12:09:07","date_gmt":"2018-02-01T12:09:07","guid":{"rendered":"https:\/\/www.mountainbikeworldwide.com\/guide-stories\/riding-the-mustang-valley-nepal"},"modified":"2024-03-13T14:36:43","modified_gmt":"2024-03-13T14:36:43","slug":"riding-the-mustang-valley-nepal","status":"publish","type":"post","link":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal","title":{"rendered":"Riding the Mustang Valley, Nepal"},"content":{"rendered":"<div class=\"wpb-content-wrapper\"><p>[vc_row][vc_column][vc_empty_space height=&#8221;32&#8243;][vc_column_text css=&#8221;.vc_custom_1517317864935{margin-top: 20px !important;}&#8221;]<\/p>\n<h1>Riding the Mustang Valley, Nepal<\/h1>\n<p>[\/vc_column_text][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][vc_column_text]<\/p>\n<p class=\"margin\">Let guest blogger Catriona Sutherland share with you her most exhilarating moments of riding in the Mustang Valley, <a href=\"https:\/\/www.mountainbikeworldwide.com\/tour\/nepal-mtb\">Nepal<\/a>.<\/p>\n<p>[\/vc_column_text][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h2>The Gate to the Mustang Valley<\/h2>\n<p>November, 2017. Engines rumbled and blades burst into action. The tiny body of our twin prop plane gently juddered as we gathered height. Headed for Jomsom in the Mustang Valley, we were taking off for the second time in our two-week trip around Nepal. A flight like no other, we were leaving Pohkara for the beautiful, barren and once forbidden Mustang region, historically known also as the Land of Lo.<\/p>\n<p>Ironically, this place is anything but.<\/p>\n<p>With 8,000 metre peaks framing either side of the flight path and on-board for just 20 minutes, we steered through the world’s deepest valley. Man-made mechanics were no match for the magnitude of the world’s greatest mountains; there was no going over, only through. Huddled at the back, my boyfriend and I took turns nosing through the window frame, in awe of the peaks around us. A tap on the shoulder brought me out of my daze and I turned left to see a tree at eye-level; the juxtaposition between plane and plant causing my mind to flip for a moment.<\/p>\n<p>[Please note: for safety reasons, we no longer take the flight from Pokhara to Jomsom, instead travelling by road.][\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_single_image image=&#8221;4393&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_empty_space][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h2>Arriving to the Rooftops<\/h2>\n<p>The sun was threatening to rise, but the morning chill was still firmly in the air. As soon as we arrived at our designated tea house we raided kit bags, searching for warmer wears in-between sips of steaming tea. This was the fifth day of our H+I Adventures mountain bike tour of Nepal, with the previous four spent adjusting to both culture and climate in the foothills of the capital city. In sharp contrast to our present position, we’d pedalled through Kathmandu Valley: a mix of pine forests and padi fields, intertwined with city sights and temple delights.[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_row_inner][vc_column_inner width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4395&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column_inner][vc_column_inner width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4396&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column_inner][\/vc_row_inner][vc_single_image image=&#8221;4388&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_empty_space][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h2 class=\"p1\"><span class=\"s1\">Lofty Heights on Mountain Bikes<\/span><\/h2>\n<p class=\"p1\">Our systems were somewhat in shock. with Jomsom’s altitude reaching 2,700 metres – it was safe to say we’d be going very slowly. Taking off from the teahouse, our destination was the nearby village of Kagbeni, but first was the matter of suspension bridges and a steep climb for afternoon tea in the tiny village of Falyak. With a lunar-like feel, we rode the rock-strewn trail over the dried-out Kali Gandaki riverbed – with sounds of crunching coming from the scatters of icy patches – the only water that remained.<\/p>\n<p>Looking ahead you’d be forgiven for thinking the trail seemed simple. Throw in some heavy gusts of afternoon wind, a narrow, wire bridge crossing over a deep ravine and some punchy ascent to boot. That’s more like it.  We winched our way towards the small village settlement, our hearts and lungs pouncing from our chests. Catching our breath, as we pulled over to the side of the trail, our excitement unearthed a flock of feasting vultures and they took off into the sky. Grabbing cameras, we stood in amazement watching their wingspan at work.<\/p>\n<p>Altitude is a strange thing. Feeling almost out-of-body, I moved at sloth-like pace, or so it seemed. Our first stop was to a local farmer’s house; the doors opened by a curious young boy who was keen to show us to his rooftop for cups of quenching tea.<\/p>\n<p class=\"bigquote\">&#8220;We winched our way towards the small village settlement, our hearts and lungs pouncing from our chests.&#8221;<\/p>\n<p>How humble I felt climbing up the narrow ladder of their home – simple steps carved into a tree trunk – which led us to a perfect platform to relax and absorb the intense view. From down below, a grinning face appeared. Laughing and looking inquisitive, a little girl peered out at the band of bizarrely clad strangers. The grandchild of our amiable host, Jamling, she was quite the entertainer, posing for photos and chatting happily to our Nepali guides.<\/p>\n<p>Legs revived, we headed for our night’s accommodation – descending at speed through the village perimeter and quickly back to the swaying bridge. Gulping as I crossed, I ducked low and kept speed to avoid being snared by the wind, not daring to look anywhere other than directly ahead. As is the case in the Highlands of Nepal, strong gusts lashed out at us on our return. Covering just 17 kilometres, we were certainly ready for Dhal Bat and beers within the walls of our cosy, eco guest house.[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_single_image image=&#8221;4397&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_row_inner][vc_column_inner width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4398&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column_inner][vc_column_inner width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4399&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column_inner][\/vc_row_inner][vc_single_image image=&#8221;4400&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_empty_space][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h2 class=\"p1\"><span class=\"s1\">Arrival to Kagbeni<\/span><\/h2>\n<p>Kagbeni is a remote mountain village and home to only 1200 people of predominately Tibetan culture. Winding through the narrow crooks and alleyways, it was alive with herds of cattle, flocks of chickens and children playing. I chuckled as we passed<em> “Yak Donalds”<\/em>– a sign of western culture and humour creeping in.<\/p>\n<p>Contrasting the muted stone walls, a rush of colour appeared from a newly built temple that shone fiery red and gold. As we rode the streets, we heard the familiar, rattling sounds of prayer wheels spinning, one that we’d come to known from our temple travels.[\/vc_column_text][vc_empty_space][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_row_inner][vc_column_inner width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4401&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column_inner][vc_column_inner width=&#8221;1\/2&#8243;][vc_single_image image=&#8221;4402&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][\/vc_column_inner][\/vc_row_inner][vc_single_image image=&#8221;4403&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_empty_space][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h2>The Road to Muktinath<\/h2>\n<p>Rising the next day, we met over breakfast to feast on fresh eggs, garlic potatoes and porridge; no calories left unconsumed given the hard work ahead. A local election had led to an impromptu vehicle curfew that day, so instead of the usual uplift by van, we’d be making the monumental climb to Muktinath from our village base by bike – a 1000 metre ascent over just 12 kilometres.<\/p>\n<p>Thankfully for us, the road had in recent times, been laid with tarmac. Ordinarily, this wouldn’t be voted with a cheer from a team of trail-hungry riders, however, with the roads empty of traffic and tales of torturous past efforts before the asphalt – we felt grateful and rode off contentedly towards the summit.<\/p>\n<p>The beguiling nature of the mountains was instantaneous and we climbed in amazement of our surroundings. In near silence, I found a solitary spot amongst our pack, content in my own world of riding. This time I wasn’t here to race, I wasn’t here to score points – just to find a rhythm and lap up the cathartic nature of being in the mountains. Wholeheartedly this was my happy place and where I’m most at peace in my mind.<\/p>\n<p>Reaching the top, cheers from the team spurred on my final strokes. Tiring, I took a well earned rest and dived into the slabs of Swiss chocolate so generously shared by our fellow compadres. Sugar-loaded and a little oxygen deficient – the descent was ours for the taking – what goes up must indeed, go down. Fast.<\/p>\n<p>Rapidly we took off, skipping over rocks and rough animal tracks, passing through village streets and ducking under tight passageways, trying to avoid decapitation. Full-throttle thrills were unleashed as we sped down the mountain side, meeting at the familiar Beni-LoMangtang track where’d we entered this spectacular setting.<\/p>\n<p>Once again, we  braved the brutal winds on our return, with a hike-a-bike thrown in for good measure. Eyes weary and legs heavy, it was time for coffee and Dal Bhat as we arrived in Kagbeni, a tasty reward to revive us for an epic day ahead.<\/p>\n<p class=\"bigquote\">&#8220;In near silence, I found a solitary spot amongst our pack, content in my own world of riding.&#8221;<\/p>\n<p>[\/vc_column_text][vc_empty_space][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_single_image image=&#8221;4404&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_single_image image=&#8221;4405&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_empty_space][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h2>Lupra Pass<\/h2>\n<p>With the roads now in full swing, we jumped aboard the bus, our portal to the starting point at Muktinath. Crater-sized holes and off-camber turns jolted us from bench to bench before we met the tarmac from the day before. Now smoothly, we continued the journey to the top.<\/p>\n<p>Within moments of starting the upward cycle to the summit of Lupra Pass, my rear tyre gave way. As the rest of the group rode on, our helpful guide Suraj jumped to the task – plugging the pesky tear made by an inauspicious rock. Soon we were on our way to catch the group. Having jumped straight on the saddle at 3,800 metres, I begged my legs to respond – not much was in there. Heaving like a serial smoker on the final punchy climb, I succumbed to walking the few metres to the top, eventually reaching 4,100 metres – our highest and most dramatic juncture of the trip.[\/vc_column_text][vc_empty_space][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_single_image image=&#8221;4406&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_empty_space][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h2>Windswept Highs and Apple Pies<\/h2>\n<p>Marked by a carefully crafted cairn of prayer flags, we rallied together at the top – cameras snapping and mouths munching amongst smiles and gasps for air. Straight ahead was Dhualagiri, the 7th highest mountain in the world, its south face still to be summited.<\/p>\n<p>Downward delight was soon to follow. We formed our line of riders – speed demons to the front  – and let loose on the track. Swooping turns looped us down the mountain that was open and exposed, with tiny stones and rocks in constant motion. At one point, I took a cut-through line. Composing myself before I dropped into the trail – a massive swipe of wind caught me just as I found the balance point on my pedals and threw me to the floor. Ouch. Shaking off the dust, it’s hard to concentrate as your brain searches for oxygen. Feeling fuzzy and off-centre is standard practice and the wind wasn’t aiding my attempts.<\/p>\n<p>Further down, the exposure was surreal. We traversed steadily, making progress until we hit the riverbed and levelled out towards Jomsom. Soon enough we were on the well-known path back to our first tea stop. Lashings of Dal Bhat were devoured; milky, hot masala Chai washed it down and warmed us up. Finishing the day, we were aiming for Marpha, the Nepalese home of apple pie. Now there’s an incentive to pedal fast!<\/p>\n<p>The day’s wind speed was almost a record – the belligerent blasts very nearly broke us as we battled the last few kilometres. Windswept but ecstatic after our epic ride amongst the mountain peaks, we huddled around the table sipping tea, coupled with the odd bottle of rum and geared up for the longest day, which was yet to come.[\/vc_column_text][vc_empty_space][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_single_image image=&#8221;4407&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221;][vc_empty_space][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h2>Marpha to Tatopani<\/h2>\n<p>I woke feeling decidedly dozy and slow. Despite the altitude falling with each day, the tiredness and chill seemed to have taken its toll. As we rode off within the world’s deepest valley, I didn’t feel present. Bouncing over boulders, we followed the flow of the riverbed and eventually skirted on to our next piece of trail, a mild teaser before the sting in the tail.<\/p>\n<p>Losing my balance, I toppled to the side, crashing hard and was soon the centre of a first aid scene. With not much to worry about, I shook it off and tried to focus on the nippy ascent we were about to ensue. With Annapurna South and Dhaulgiri towering over us, we whipped through vastness and variety; forest trails, river beds, dirt roads and eventually into warmer, wetter climes and local townships. Peacefully, villagers watched us as we sped through the street, wheels following carefully crafted chutes of stone.<\/p>\n<p>The talk of the day was just in front. Whilst technically a road, there’s no tarmac and it’s certainly not sterile. Likened to the renowned Fort William downhill track, it threw not just dust, but 27 kilometres of rutted, rocky, loose and lairy trail, not to mention traffic. Buses and cars worked in perfect flow with people and animals, no sign of frustration or fluster on either side.<\/p>\n<p>At the bottom – we pulled in to our stop for the evening, feeling the marked rise in heat and humidity. Faces awash with dust and dirt, the moment seemed too good to miss. Amongst beers and laughter, photos of our mucky features were captured for lasting memories of this unforgettable descent.[\/vc_column_text][vc_empty_space][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row][vc_row][vc_column][vc_empty_space][vc_media_grid element_width=&#8221;3&#8243; initial_loading_animation=&#8221;none&#8221; grid_id=&#8221;vc_gid:1704298571330-8f90c520-9c3a-8&#8243; include=&#8221;303764,303804,303803,303805&#8243;][vc_empty_space][vc_separator color=&#8221;black&#8221; align=&#8221;align_left&#8221; border_width=&#8221;8&#8243; el_width=&#8221;10&#8243; css=&#8221;.vc_custom_1493823688550{padding-right: 40px !important;}&#8221;][\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/6&#8243;][\/vc_column][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h2>Farewell Mustang<\/h2>\n<p>Back on the bike for the final day, it was a chance to simply spin the legs and follow the familiar road – albeit a little less lumpy and loud – back to the town of Beni. From there, we took a shuttle to Pokhara for a night’s pitstop, then a final flight back to Kathmandu and the hustle of city life.<\/p>\n<p>Tired from our consistent days of pedalling, I rode the final stretch reflecting on the intense, epic and diverse moments we’d shared on the trails. Arriving at Beni, we cheered and hugged in celebration of the journey – plenty stories, smiles and even some sores to keep it alive for the weeks to come.[\/vc_column_text][vc_empty_space][\/vc_column][vc_column width=&#8221;1\/6&#8243;][\/vc_column][\/vc_row]<\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>Guest blogger Catriona Sutherland takes us along on her mountain bike journey into the wild and windy depths of the Mustang Valley, Nepal.<\/p>\n","protected":false},"author":1,"featured_media":6224,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[47],"tags":[],"class_list":["post-4386","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-travel-inspiration"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v23.4 (Yoast SEO v24.2) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Riding the Mustang Valley, Nepal | H+I Adventures<\/title>\n<meta name=\"description\" content=\"Guest blogger Catriona Sutherland takes us along on her mountain bike journey into the wild and windy depths of the Mustang Valley, Nepal.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Riding the Mustang Valley, Nepal | H+I Adventures\" \/>\n<meta property=\"og:description\" content=\"Guest blogger Catriona Sutherland takes us along on her journey into the wild and windswept depths of the Mustang Valley, Nepal\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal\" \/>\n<meta property=\"og:site_name\" content=\"H+I Adventures\" \/>\n<meta property=\"article:published_time\" content=\"2018-02-01T12:09:07+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-03-13T14:36:43+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"form_admin\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:title\" content=\"Riding the Mustang Valley, Nepal | H+I Adventures\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"form_admin\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"1 minute\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal\"},\"author\":{\"name\":\"form_admin\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/5dc539fefacbad4fbd5ad01fc49c0b97\"},\"headline\":\"Riding the Mustang Valley, Nepal\",\"datePublished\":\"2018-02-01T12:09:07+00:00\",\"dateModified\":\"2024-03-13T14:36:43+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal\"},\"wordCount\":2839,\"publisher\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2024\/01\/Mountain-biking-mustang-nepal-story-catriona.jpg\",\"articleSection\":[\"Travel Inspiration\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal\",\"url\":\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal\",\"name\":\"Riding the Mustang Valley, Nepal | H+I Adventures\",\"isPartOf\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2024\/01\/Mountain-biking-mustang-nepal-story-catriona.jpg\",\"datePublished\":\"2018-02-01T12:09:07+00:00\",\"dateModified\":\"2024-03-13T14:36:43+00:00\",\"description\":\"Guest blogger Catriona Sutherland takes us along on her mountain bike journey into the wild and windy depths of the Mustang Valley, Nepal.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#primaryimage\",\"url\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2024\/01\/Mountain-biking-mustang-nepal-story-catriona.jpg\",\"contentUrl\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2024\/01\/Mountain-biking-mustang-nepal-story-catriona.jpg\",\"width\":1920,\"height\":1076,\"caption\":\"Sunshine over the Himalayas of Nepal\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.mountainbikeworldwide.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Riding the Mustang Valley, Nepal\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#website\",\"url\":\"https:\/\/www.mountainbikeworldwide.com\/\",\"name\":\"H+I Adventures\",\"description\":\"At H+I Adventures we specialise in crafting life-affirming MTB tours and e-mountain bike holidays in exotic locations around the world. That’s all we do.\",\"publisher\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.mountainbikeworldwide.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#organization\",\"name\":\"H+I Adventures\",\"url\":\"https:\/\/www.mountainbikeworldwide.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png\",\"contentUrl\":\"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png\",\"width\":1200,\"height\":630,\"caption\":\"H+I Adventures\"},\"image\":{\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/5dc539fefacbad4fbd5ad01fc49c0b97\",\"name\":\"form_admin\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/38964b5c442fcfa6225311b084d13024?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/38964b5c442fcfa6225311b084d13024?s=96&d=mm&r=g\",\"caption\":\"form_admin\"},\"sameAs\":[\"https:\/\/h-i.form-digital-staging.com\"],\"url\":\"https:\/\/www.mountainbikeworldwide.com\/author\/form_admin\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Riding the Mustang Valley, Nepal | H+I Adventures","description":"Guest blogger Catriona Sutherland takes us along on her mountain bike journey into the wild and windy depths of the Mustang Valley, Nepal.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal","og_locale":"en_US","og_type":"article","og_title":"Riding the Mustang Valley, Nepal | H+I Adventures","og_description":"Guest blogger Catriona Sutherland takes us along on her journey into the wild and windswept depths of the Mustang Valley, Nepal","og_url":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal","og_site_name":"H+I Adventures","article_published_time":"2018-02-01T12:09:07+00:00","article_modified_time":"2024-03-13T14:36:43+00:00","og_image":[{"width":1200,"height":630,"url":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png","type":"image\/png"}],"author":"form_admin","twitter_card":"summary_large_image","twitter_title":"Riding the Mustang Valley, Nepal | H+I Adventures","twitter_misc":{"Written by":"form_admin","Est. reading time":"1 minute"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#article","isPartOf":{"@id":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal"},"author":{"name":"form_admin","@id":"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/5dc539fefacbad4fbd5ad01fc49c0b97"},"headline":"Riding the Mustang Valley, Nepal","datePublished":"2018-02-01T12:09:07+00:00","dateModified":"2024-03-13T14:36:43+00:00","mainEntityOfPage":{"@id":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal"},"wordCount":2839,"publisher":{"@id":"https:\/\/www.mountainbikeworldwide.com\/#organization"},"image":{"@id":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#primaryimage"},"thumbnailUrl":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2024\/01\/Mountain-biking-mustang-nepal-story-catriona.jpg","articleSection":["Travel Inspiration"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal","url":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal","name":"Riding the Mustang Valley, Nepal | H+I Adventures","isPartOf":{"@id":"https:\/\/www.mountainbikeworldwide.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#primaryimage"},"image":{"@id":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#primaryimage"},"thumbnailUrl":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2024\/01\/Mountain-biking-mustang-nepal-story-catriona.jpg","datePublished":"2018-02-01T12:09:07+00:00","dateModified":"2024-03-13T14:36:43+00:00","description":"Guest blogger Catriona Sutherland takes us along on her mountain bike journey into the wild and windy depths of the Mustang Valley, Nepal.","breadcrumb":{"@id":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#primaryimage","url":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2024\/01\/Mountain-biking-mustang-nepal-story-catriona.jpg","contentUrl":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2024\/01\/Mountain-biking-mustang-nepal-story-catriona.jpg","width":1920,"height":1076,"caption":"Sunshine over the Himalayas of Nepal"},{"@type":"BreadcrumbList","@id":"https:\/\/www.mountainbikeworldwide.com\/travel-inspiration\/riding-the-mustang-valley-nepal#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.mountainbikeworldwide.com\/"},{"@type":"ListItem","position":2,"name":"Riding the Mustang Valley, Nepal"}]},{"@type":"WebSite","@id":"https:\/\/www.mountainbikeworldwide.com\/#website","url":"https:\/\/www.mountainbikeworldwide.com\/","name":"H+I Adventures","description":"At H+I Adventures we specialise in crafting life-affirming MTB tours and e-mountain bike holidays in exotic locations around the world. That’s all we do.","publisher":{"@id":"https:\/\/www.mountainbikeworldwide.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.mountainbikeworldwide.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.mountainbikeworldwide.com\/#organization","name":"H+I Adventures","url":"https:\/\/www.mountainbikeworldwide.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png","contentUrl":"https:\/\/www.mountainbikeworldwide.com\/wp-content\/uploads\/2023\/09\/handi-social-card.png","width":1200,"height":630,"caption":"H+I Adventures"},"image":{"@id":"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/5dc539fefacbad4fbd5ad01fc49c0b97","name":"form_admin","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.mountainbikeworldwide.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/38964b5c442fcfa6225311b084d13024?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/38964b5c442fcfa6225311b084d13024?s=96&d=mm&r=g","caption":"form_admin"},"sameAs":["https:\/\/h-i.form-digital-staging.com"],"url":"https:\/\/www.mountainbikeworldwide.com\/author\/form_admin"}]}},"_links":{"self":[{"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/posts\/4386","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/comments?post=4386"}],"version-history":[{"count":11,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/posts\/4386\/revisions"}],"predecessor-version":[{"id":6593,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/posts\/4386\/revisions\/6593"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/media\/6224"}],"wp:attachment":[{"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/media?parent=4386"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/categories?post=4386"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.mountainbikeworldwide.com\/wp-json\/wp\/v2\/tags?post=4386"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}